La-BlueFrog/LBF-V2-SW-WIP/libraries/Sensor_APIs/STSW-IMG003/example/STM32F401CubeMXBasic/Drivers/BSP/STM32F4xx-Nucleo/stm32f4xx_nucleo_ex.h
/** 
  ******************************************************************************
  * @file    stm32f4xx_nucleo_ex.h
  * @author  AST/AMS Application Team
  * @version V1.0.0
  * @date    9-Sept-2014
  * @brief   This file contains definitions for:
  *          
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2014 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************  
  */ 
  
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32F4XX_NUCLEO_EX_H
#define __STM32F4XX_NUCLEO_EX_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"
   
/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32F4XX_NUCLEO_EX
  * @{
  */

/** @addtogroup STM32F4XX_NUCLEO_EX_LOW_LEVEL
  * @{
  */ 

/** @defgroup STM32F4XX_NUCLEO_EX_LOW_LEVEL_Exported_Types
  * @{
  */

/**
  * @}
  */ 

/** @defgroup STM32F4XX_NUCLEO_EX_LOW_LEVEL_Exported_Constants
  * @{
  */ 

/** 
  * @brief Define for STM32F4XX_NUCLEO_EX board  
  */ 
#if !defined (USE_STM32F4XX_NUCLEO_EX)
 #define USE_STM32F4XX_NUCLEO_EX
#endif

/** @addtogroup STM32F4XX_NUCLEO_LOW_LEVEL_DRDY
  * @{
  */

/**
  * @}
  */ 

/** @addtogroup STM32F4XX_NUCLEO_EX_LOW_LEVEL_LED
  * @{
  */

/**
  * @}
  */ 
  
/** @addtogroup STM32F4XX_NUCLEO_EX_LOW_LEVEL_BUTTON
  * @{
  */  

/**
  * @}
  */ 

/** @addtogroup STM32F4XX_NUCLEO_EX_LOW_LEVEL_BUS
  * @{
  */
   
 /* User can use this section to tailor USARTx/UARTx instance used and associated
    resources */
 /* Definition for USARTx clock resources */
#define USARTx                           USART2
#define USARTx_CLK_ENABLE()              __USART2_CLK_ENABLE();
#define DMAx_CLK_ENABLE()                __DMA1_CLK_ENABLE()
#define USARTx_RX_GPIO_CLK_ENABLE()      __GPIOA_CLK_ENABLE()
#define USARTx_TX_GPIO_CLK_ENABLE()      __GPIOA_CLK_ENABLE()

#define USARTx_FORCE_RESET()             __USART2_FORCE_RESET()
#define USARTx_RELEASE_RESET()           __USART2_RELEASE_RESET()

     /* Definition for USARTx Pins */
#define USARTx_TX_PIN                    GPIO_PIN_2
#define USARTx_TX_GPIO_PORT              GPIOA
#define USARTx_TX_AF                     GPIO_AF7_USART2
#define USARTx_RX_PIN                    GPIO_PIN_3
#define USARTx_RX_GPIO_PORT              GPIOA
#define USARTx_RX_AF                     GPIO_AF7_USART2

     /* Definition for USARTx's DMA */
#define USARTx_TX_DMA_CHANNEL             DMA_CHANNEL_4
#define USARTx_TX_DMA_STREAM              DMA1_Stream6
#define USARTx_RX_DMA_CHANNEL             DMA_CHANNEL_4
#define USARTx_RX_DMA_STREAM              DMA1_Stream5

/**
  * @}
  */

/** @defgroup STM32F4XX_NUCLEO_EX_LOW_LEVEL_Exported_Macros
  * @{
  */  
/**
  * @}
  */ 

void UART_STLink_IO_Init(void);
void UART_STLink_IO_Transmit(uint8_t *pData, uint16_t Size);

/**
  * @}
  */ 

/**
  * @}
  */ 

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __STM32F4XX_NUCLEO_EX_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
